#include <iostream>
#include <format>
#include <cmath>
#include <numbers>
using namespace std;

int main(){
    // завдання 1
    cout << "3 - 7/3 = " << 3 - 7/3 << endl;
    cout << "(3-7)/3 = " << (3-7)/3 << endl;
    cout << "-19%11/3 = " << -19%11/3 << endl; // -8/3 = -2
    cout << "-19/11%3 = " << -19/11%3 << endl; // -1%3 = -1
    cout << "1/3+1.0/3+1/3.0 = " << 1/3+1.0/3+1/3.0 << endl; // 0+0.3333+0.3333 = 0.6666
    cout << "(double)true = " << (double)true << endl;
    cout << "'e'-'c' = " << 'e'-'c' << endl; // 101-99 = 2
    cout << "('H'-'h')/('B'-'b') = " << ('H'-'h')/('B'-'b') << endl; // -32/-32 = 1

    // завдання 2
    cout << "cos(3*pi/16) = " << cos(3*numbers::pi/16) << endl;
    cout << "sqrt(pow(9.1, 4)+pow(3.7, 4)) = " << sqrt(pow(9.1, 4)+pow(3.7, 4)) << endl;
    cout << "log10(13) / log10(4/19) = " << log10(13) / log10(4/19) << endl;
    cout << "pow(2, 2*numbers::e) = " << pow(2, 2*numbers::e) << endl;

    // завдання 3
    int a=3, b=2;
    a+=4; 
    b*=(a-=2)+1; 
    cout<<a<<" "<<b<<endl;
    // буде виведено "5 12",
    //оскільки а спочатку перевизначається на 7, згодом на 5.
    //b в свою чергу множиться на 5+1, тобто 2*6=12.

    // завдання 4
    cout << "53/13 * 14/3 * 8/7 = " << 53.0/13 * 14.0/3 * 8.0/7 << endl;
    cout << "(41.1*52)/(2013+81) = " << (41.1*52)/(2013+81) << endl;

    // завдання 5
    double x;
    cout << "Введіть число: ";
    cin >> x;
    cout << "arcctg(" << x << ") = " << format("{:.5f}\n", 1/tan(x)) << endl;

    // завдання 6
    cout << "(pow(10.001, 343) * pow(14.001, 287)) / (pow(9.001, 355) * pow(12.001, 310)) = " << double(pow(10.001, 343) * pow(14.001, 287)) / double(pow(9.001, 355) * pow(12.001, 310)) << endl;
    // занадто велике число, тому використаємо перетворення:
    cout << "(pow(10.001, 343) * pow(14.001, 287)) / (pow(9.001, 355) * pow(12.001, 310)) = " << exp(343*log(10.001) + 287*log(14.001) - 355*log(9.001) - 310*log(12.001)) << endl;
}